In [79]:
import pandas as pd 
x="data.csv"
df=pd.read_csv(x)
print(df)

   Unnamed: 0  col1  col2   col3
0           0    20     40    60
1           1    30     50    80
2           2    40     60   100

In [80]:
#3. 
import pandas as pd 
data = {'Name': ['Teodosija', 'Sutton', 'Taneli', 'Ravshan', 'Ross'],
        'Age': [26, 32, 25, 31, 28],
        'Salary': [50000, 60000, 45000, 70000, 55000]}
df=pd.DataFrame(data)
rows=df[(df["Age"]>25) & (df["Salary"]>50000)]
print(rows)

      Name  Age  Salary
1   Sutton   32   60000
3  Ravshan   31   70000
4     Ross   28   55000

In [15]:
#4. 
import pandas as pd 
data= {'Name': ['Teodosija', 'Sutton', 'Taneli', 'Ravshan', 'Ross','Teodosija', 'Sutton', 'Taneli','Teodosija', 'Sutton', 'Taneli'],
        'Age': [26, 32, 25, 31, 28,26, 32, 25,26, 32, 25],
        'Salary': [50000, 60000, 45000, 70000, 55000,61000,65555,50000, 60000, 45000, 70000]}
df=pd.DataFrame(data)
print(df.head(7))

        Name  Age  Salary
0  Teodosija   26   50000
1     Sutton   32   60000
2     Taneli   25   45000
3    Ravshan   31   70000
4       Ross   28   55000
5  Teodosija   26   61000
6     Sutton   32   65555

In [20]:
#5. 
import pandas as pd 
data={'Name': ['Teodosija', 'Sutton', 'Taneli', 'Ravshan', 'Ross'],
        'Age': [26, 32, 25, 31, 28],
        'Salary': [50000, 60000, 45000, 70000, 55000]}
df=pd.DataFrame(data)
filter_df=df[df["Salary"]>55000]
print(filter_df)

      Name  Age  Salary
1   Sutton   32   60000
3  Ravshan   31   70000

In [22]:
#6.
import pandas as pd 
import numpy as np 
data={'Name': ['Teodosija', 'Sutton', 'Taneli', 'Ravshan', 'Ross'],
        'Age': [26, 32, 25, 31, 28],
        'Salary': [50000, 60000, 45000, 70000, 55000]}
df=pd.DataFrame(data) 
new_column=df["2Age"]=np.multiply(df["Age"],2)
print(new_column)

0    52
1    64
2    50
3    62
4    56
Name: Age, dtype: int64

In [25]:
#7. 
import pandas as pd 
data1={
    'id': [1, 2, 3],
    'name': ['Ali', 'Veli', 'Ayşe'],
    'age': [25, 30, 22]
}
data2={
    'id': [1, 2, 3],
    'name': ['Ali', 'Veli', 'Ayşe'],
    'age': [25, 30, 22]
}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
pd.merge(df1,df2,on='id',how="inner")

   id name_x  age_x name_y  age_y
0   1    Ali     25    Ali     25
1   2   Veli     30   Veli     30
2   3   Ayşe     22   Ayşe     22

In [34]:
#13. 
data = {'Category': ['A', 'B', 'A', 'B', 'A', 'C'],
        'Values': [100, 200, 300, 400, 500, 600]}
df=pd.DataFrame(data)
new_data=df.groupby('Category')['Values'].sum()
print(new_data)

Category
A    900
B    600
C    600
Name: Values, dtype: int64

In [48]:
#15.
import pandas as pd 
data = {
  "Duration":{
    "0":60,
    "1":60,
    "2":60,
    "3":45,
    "4":45,
    "5":60
  },
  "Pulse":{
    "0":110,
    "1":117,
    "2":103,
    "3"
    "4":117,
    "5":102
  },
  "Maxpulse":{
    "0":130,
    "1":145,
    "2":135,
    "3":175,
    "4":148,
    "5":127
  },
  "Calories":{
    "0":409,
    "1":479,
    "2"
    "3":282,
    "4":406,
    "5":300
  }
}
df=pd.DataFrame(data)
df.fillna(df.mean(numeric_only=True),inplace=True)
print(df)

    Duration  Pulse    Maxpulse  Calories
0       60.0  110.0  130.000000     409.0
1       60.0  117.0  145.000000     479.0
2       60.0  103.0  135.000000     375.2
3       45.0  109.8  175.000000     375.2
4       45.0  109.8  148.000000     406.0
5       60.0  102.0  127.000000     300.0
34      55.0  117.0  143.333333     375.2
23      55.0  109.8  143.333333     282.0

In [49]:
#17. 
import pandas as pd 
data = {'Name': ['Ross', 'Bob', 'Ross', 'Geoffrey', 'Bob'],
        'Age': [25, 30, 25, 25, 30],
        'Salary': [50000, 50000, 50000, 45000, 60000]}
df=pd.DataFrame(data)
no_duplicates=df.drop_duplicates()
print(no_duplicates)

       Name  Age  Salary
0      Ross   25   50000
1       Bob   30   50000
3  Geoffrey   25   45000
4       Bob   30   60000

In [50]:
#18. 
import pandas as pd 
data = {'Name': ['Ross', 'Bob', 'Ross', 'Geoffrey', 'Bob'],
        'Age': [25, 30, 25, 25, 30],
        'Salary': [50000, 50000, 50000, 45000, 60000]}
df=pd.DataFrame(data)
no_duplicates=df.drop_duplicates()
print(no_duplicates)

       Name  Age  Salary
0      Ross   25   50000
1       Bob   30   50000
3  Geoffrey   25   45000
4       Bob   30   60000

In [51]:
#28. 
import pandas as pd 
data={'Name': ['Ross', 'Bob', 'Ross', 'Geoffrey', 'Bob'],
        'Age': [25, 30, 25, 25, 30],
        'Salary': [50000, 50000, 50000, 45000, 60000]}
df=pd.DataFrame(data)
df.sort_values(by='Salary',ascending=False)

       Name  Age  Salary
4       Bob   30   60000
0      Ross   25   50000
1       Bob   30   50000
2      Ross   25   50000
3  Geoffrey   25   45000

In [54]:
#30.
import pandas as pd 
data={'Name': ['Ross', 'Bob', 'Ross', 'Geoffrey', 'Bob'],
        'Age': [25, 30, 25, 25, 30],
        'Salary': [50000, 50000, 50000, 45000, 60000]}
df=pd.DataFrame(data)
df.rename(columns={"Salary":"Maas"},inplace=True)
print(df)

       Name  Age   Maas
0      Ross   25  50000
1       Bob   30  50000
2      Ross   25  50000
3  Geoffrey   25  45000
4       Bob   30  60000

In [58]:
#31. 
import pandas as pd 
data={'Name': ['Ross', 'Bob', 'Ross', 'Geoffrey', 'Bob'],
        'Age': [25, 30, 25, 25, 30],
        'Salary': [50000, 50000, 50000, 45000, 60000]}
df=pd.DataFrame(data)
print(df)
transpose_data=df.transpose()
print(transpose_data)

       Name  Age  Salary
0      Ross   25   50000
1       Bob   30   50000
2      Ross   25   50000
3  Geoffrey   25   45000
4       Bob   30   60000
            0      1      2         3      4
Name     Ross    Bob   Ross  Geoffrey    Bob
Age        25     30     25        25     30
Salary  50000  50000  50000     45000  60000

In [70]:
#32. 
import pandas as pd 
d1= {
    "ortaq": [101, 102, 103, 104, 105],
    "ad": ["Aysel", "Murad", "Ramil", "Ləman", "Tunar"],
    "yaş": [25, 30, 28, 27, 32],
    "şəhər": ["Bakı", "Gəncə", "Sumqayit", "Şəki", "Lənkəran"],
    "maaş": [1200, 1500, 1300, 1400, 1600]
}
d2={
    "ortaq": [101, 102, 106, 107, 105],
    "vəzifə": ["Mühəndis", "Menecer", "Analitik", "Texniki dəstək", "Direktor"],
    "təhsil": ["Magistr", "Bakalavr", "Magistr", "Orta ixtisas", "Magistr"],
    "təcrübə": ["3 il", "5 il", "2 il", "1 il", "8 il"],
    "şöbə": ["İT", "Satis", "Marketinq", "Müştəri xidməti", "İdarəetmə"]
}
df=pd.DataFrame(d1)
df2=pd.DataFrame(d2)
pd.merge(df,df2,on="ortaq",how="inner")

   ortaq     ad  yaş     şəhər  maaş    vəzifə    təhsil təcrübə       şöbə
0    101  Aysel   25      Bakı  1200  Mühəndis   Magistr    3 il         İT
1    102  Murad   30     Gəncə  1500   Menecer  Bakalavr    5 il      Satis
2    105  Tunar   32  Lənkəran  1600  Direktor   Magistr    8 il  İdarəetmə

In [ ]:
#33. 
import pandas as pd 
data = {
    'Category': ['A', 'A', 'B', 'B', 'C', 'C'],
    'Sales': [100, 150, 200, 250, 300, 350],
    'Profit': [10, 15, 20, 25, 30, 35]
}
df=pd.DataFrame(data)
df.groupby('Category').agg({
    'Sales':["sum","mean"],
    'Profit':["sum","mean"]
})

         Sales        Profit
           sum   mean    sum  mean
Category
A          250  125.0     25  12.5
B          450  225.0     45  22.5
C          650  325.0     65  32.5

In [78]:
#34. 
import pandas as pd 
data = {'DateTime': ['2012-01-01 08:30:00', '2012-01-02 12:45:00', '2012-01-03 18:15:00']}
df = pd.DataFrame(data)
df['DateTime']=pd.to_datetime(df['DateTime'])
df['Year']=df['DateTime'].dt.year
df['Month']=df['DateTime'].dt.month
df['Day']=df['DateTime'].dt.day
df['Hour']=df['DateTime'].dt.hour
df['Minute']=df['DateTime'].dt.minute
df['Second']=df['DateTime'].dt.second
print(df)

             DateTime  Year  Month  Day  Hour  Minute  Second
0 2012-01-01 08:30:00  2012      1    1     8      30       0
1 2012-01-02 12:45:00  2012      1    2    12      45       0
2 2012-01-03 18:15:00  2012      1    3    18      15       0